{
  "products": [
    {
      "id": 1,
      "name": "Apple iPhone 11",
      "category": "Apple",
      "price": 64900,
      "rating": 4.7,
      "description": "The Apple iPhone XI is armed with dual primary cameras - 12MP + 12MP lenses. The lenses are assisted by a Back-illuminated sensor (BSI) that helps to click crisp and clear images. The setup is also capable of recording high-definition videos. There is a 12MP front camera accompanied by a Retina Flash. The front snapper does well, which capturing excellent selfies and also assists to facilitate video calling. The device houses non-expandable storage of 64GB, which can save a lot of files and documents in it.",
      "imageUrls": [
        "https://www.91-img.com/pictures/132396-v8-apple-iphone-xi-mobile-phone-medium-1.jpg"
      ]
    },
    {
      "id": 2,
      "name": "Apple iPhone XR",
      "category": "Apple",
      "price": 48100,
      "rating": 4.5,
      "description": "The Apple iPhone XR shines a great LCD display of 6.1-inch with a screen resolution of 828 x 1,792 Pixels and a pixel density of 324ppi. It offers protections like Screen damage protection, dustproof and water resistant IP67. The device sports a superb rear camera of 12MP with features like Back-illuminated sensor, physical aperture f1.8, Quad LED true tone flash and a lot more than helps the user to shoot pictures and videos of unmatched quality. The front camera on the device is of 7MP with a Back-illuminated sensor, a Retina flash and more to click selfies like a pro.",
      "imageUrls": [
        "https://www.91-img.com/pictures/129877-v7-apple-iphone-xr-mobile-phone-medium-1.jpg"
      ]
    },
    {
      "id": 3,
      "name": "Apple iPhone 7",
      "category": "Apple",
      "price": 28500,
      "rating": 4.2,
      "description": "The Apple iPhone 7 is armed with a 12MP rear camera which is so far the most powerful camera Apple has produced. It has optical image stabilization, an f/1.8 aperture, and a six-element lens and has four smart LED flash that delivers 50 percent brighter photos as compared to the iPhone 6s.  It also senses the environment and adjusts itself to produce better lit and sharper photos. Shooting videos is also a delight with this beauty as it can capture high-resolution 4K videos to keep your memories from fading. With the new aperture settings and OIS, videos shot in darker settings with iPhone 7 are also much more enhanced than those taken by its older siblings.The 7MP FaceTime HD camera is as amazing as it can be. It uses wide color capture to take sharper and more vibrant selfies. The Retina Flash matches the ambient light for a shot to produce natural-looking skin tones.On the storage front, Apple has abandoned its signature 16GB storage variant and starts the line with 32GB of storage, which is further followed by 128GB and 256GB. Memory expansion, however, remains non-existent.",
      "imageUrls": [
        "https://www.91-img.com/pictures/97744-v1-apple-iphone-7-mobile-phone-medium-1.jpg"
      ]
    }
  ]
}
